cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'osx-cross/avr'
tap 'px4/px4'

brew 'automake'
brew 'avrdude'
brew 'fzf'
brew 'readline'
brew 'xz'
brew 'awscli'
brew 'bento4'
brew 'coreutils'
brew 'ctop'
brew 'dfu-programmer'
brew 'ffmpeg'
brew 'flake8'
brew 'fswatch'
brew 'gnupg'
brew 'go'
brew 'grc'
brew 'hub'
brew 'jq'
brew 'kubernetes-cli'
brew 'libtool'
brew 'libgit2'
brew 'lua'
brew 'openssl'
brew 'luajit'
brew 'luarocks'
brew 'node'
brew 'nodenv'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim', args: ['with-override-system-vi']
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'osx-cross/avr/avr-gcc'
brew 'px4/px4/gcc-arm-none-eabi'

cask '1password'
cask 'firefox'
cask 'garmin-express'
cask 'google-chrome'
cask 'handbrake'
cask 'ngrok'
cask 'seashore'
cask 'slack'
/* cask 'steam' */
cask 'transmission'
cask 'tunnelbear'
/* cask 'vlc' */
